src/cf/Catalogs/БрендЗона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>БрендЗона</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтендов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБрендЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБрендЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМагазина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидМагазина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервойУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыБрендЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоSKU106</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоSKU053</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыУПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодУПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоSKU106</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоSKU053</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотСПолкиПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗакрытияФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБрендЗоны</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыБрендЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыБрендЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВидыБрендЗоны</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БрендЗонаВОГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупленныеПолки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрендЗонаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПалитраОК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПалитраВашихСтен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВидМагазина</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФирменныйМагазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрендЗона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/БрендЗона/Ext/ObjectModule.bsl
// ++ VOG Солодов В.В. 13.09.2021 CRM-1148
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидБрендЗоны();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидБрендЗоны()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаКоды.ВидБрендЗоны КАК ВидБрендЗоны,
	|	ТаблицаКоды.ДатаЗакрытияФакт КАК ДатаЗакрытияФакт
	|ПОМЕСТИТЬ ВТ_ВидыБрендЗоны
	|ИЗ
	|	&ТаблицаКоды КАК ТаблицаКоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны КАК ВидБрендЗоны,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыБрендЗон
	|ИЗ
	|	ВТ_ВидыБрендЗоны КАК ВТ_ВидыБрендЗоны
	|ГДЕ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны = ЗНАЧЕНИЕ(Перечисление.ВидыБрендЗоны.ПалитраВашихСтен)
	|	И &ВидМагазина = ЗНАЧЕНИЕ(Перечисление.ВидМагазина.ФирменныйМагазин)
	|	И ВТ_ВидыБрендЗоны.ДатаЗакрытияФакт = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны,
	|	2
	|ИЗ
	|	ВТ_ВидыБрендЗоны КАК ВТ_ВидыБрендЗоны
	|ГДЕ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны = ЗНАЧЕНИЕ(Перечисление.ВидыБрендЗоны.ПалитраОК)
	|	И &ВидМагазина = ЗНАЧЕНИЕ(Перечисление.ВидМагазина.ФирменныйМагазин)
	|	И ВТ_ВидыБрендЗоны.ДатаЗакрытияФакт = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны,
	|	1
	|ИЗ
	|	ВТ_ВидыБрендЗоны КАК ВТ_ВидыБрендЗоны
	|ГДЕ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны = ЗНАЧЕНИЕ(Перечисление.ВидыБрендЗоны.БрендЗонаКлиента)
	|	И &ВидМагазина = ЗНАЧЕНИЕ(Перечисление.ВидМагазина.БрендЗона)
	|	И ВТ_ВидыБрендЗоны.ДатаЗакрытияФакт = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны,
	|	2
	|ИЗ
	|	ВТ_ВидыБрендЗоны КАК ВТ_ВидыБрендЗоны
	|ГДЕ
	|	ВТ_ВидыБрендЗоны.ВидБрендЗоны = ЗНАЧЕНИЕ(Перечисление.ВидыБрендЗоны.БрендЗонаВОГ)
	|	И &ВидМагазина = ЗНАЧЕНИЕ(Перечисление.ВидМагазина.БрендЗона)
	|	И ВТ_ВидыБрендЗоны.ДатаЗакрытияФакт = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ПриоритетыБрендЗон.ВидБрендЗоны КАК ВидБрендЗоны
	|ИЗ
	|	ВТ_ПриоритетыБрендЗон КАК ВТ_ПриоритетыБрендЗон
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВТ_ПриоритетыБрендЗон.Приоритет) КАК Приоритет
	|		ИЗ
	|			ВТ_ПриоритетыБрендЗон КАК ВТ_ПриоритетыБрендЗон) КАК ВложенныйЗапрос
	|		ПО ВТ_ПриоритетыБрендЗон.Приоритет = ВложенныйЗапрос.Приоритет";
	
	ТаблицаКоды = КодыУПП.Выгрузить(, "ВидБрендЗоны, ДатаЗакрытияФакт");
	
	Запрос.УстановитьПараметр("ТаблицаКоды", ТаблицаКоды);
	Запрос.УстановитьПараметр("ВидМагазина", ВидМагазина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидБрендЗоны = ВыборкаДетальныеЗаписи.ВидБрендЗоны;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
// -- VOG Солодов В.В. 13.09.2021 CRM-1148
